In [13]:
import pandas as pd

# Урок 1. Модели данных и нормализация таблиц. Схема «звезда»
Нарисуйте архитектуру ETL процесса для сбора и анализа данных компанией,

которая хочет провести маркетинговую кампанию, используя app.diagrams.net.

Сделайте описание почему вы считаете что архитектура должна выглядеть именно так.

<img src='/Users/mariannasarkisan/Desktop/HW1.ipynb/task_1.drawio.png'>

**На этапе выгрузки данных (Extract):**

У маркетинговой компании имеется клиентская база, которую будем использовать как источник выгрузки данных.

Также получим данные из CRM-системы, используемой в компании для взаимодейтсвия с клиентами.

Кроме того, будем учитывать результаты проведенных компанией опросов и исследований.

**На этапе обработки данных (Transform):**

Здесь важной задачей является агрегация и приведение всех данных к виду, подходящему для аналитического использования.

**На этапе загрузки данных (Load):**

Данные предоставляются аналитическим системам, где помогут проводить качественные маркетинговые кампании.

## Задание 2

<img src='/Users/mariannasarkisan/Desktop/HW1.ipynb/task_2_1.drawio.png'>

<img src='/Users/mariannasarkisan/Desktop/HW1.ipynb/task_2_2.drawio.png'>

## Задание 3

Определите в какой нормальной форме данная таблица, приведите её ко 2 и 3 нормальным формам последовательно.

<img src='/Users/mariannasarkisan/Desktop/HW1.ipynb/hw1_3.png'>

In [14]:
task3_df_src = pd.DataFrame({
    'Employee_ID': ['E001', 'E001', 'E002', 'E002', 'E003'],
    'Name': ['Alice', 'Alice', 'Bob', 'Bob', 'Alice'],
    'Job_сode': ['J01', 'J02', 'J02', 'J03', 'J01'],
    'Job': ['Chef', 'Waiter', 'Waiter', 'Bartender', 'Chef'],
    'City_code': [26, 26, 56, 56, 56],
    'Home_city': ['Moscow', 'Moscow', 'Perm', 'Perm', 'Perm']
})
task3_df_src

  Employee_ID   Name Job_сode        Job  City_code Home_city
0        E001  Alice      J01       Chef         26    Moscow
1        E001  Alice      J02     Waiter         26    Moscow
2        E002    Bob      J02     Waiter         56      Perm
3        E002    Bob      J03  Bartender         56      Perm
4        E003  Alice      J01       Chef         56      Perm

Таблица находится в 1NF, поскольку все ее записи являются атомарными и имеют составной первичный ключ (Employee_ID, Job_Code).

**Приведение к 2NF**

In [15]:
task3_job_roles = task3_df_src[['Employee_ID', 'Job_сode']]
task3_job_roles

  Employee_ID Job_сode
0        E001      J01
1        E001      J02
2        E002      J02
3        E002      J03
4        E003      J01

In [16]:
task3_employees = task3_df_src[['Employee_ID', 'Name', 'City_code', 'Home_city']].drop_duplicates().reset_index(drop=True)
task3_employees

  Employee_ID   Name  City_code Home_city
0        E001  Alice         26    Moscow
1        E002    Bob         56      Perm
2        E003  Alice         56      Perm

In [17]:

task3_jobs = task3_df_src[['Job_сode', 'Job']].drop_duplicates().reset_index(drop=True)
task3_jobs

  Job_сode        Job
0      J01       Chef
1      J02     Waiter
2      J03  Bartender

Теперь видим, что Home_city зависит от City_code.

Таким образом, если мы знаем City_code, то можем определить значение Home_city.

**Приведение к 3NF**

In [18]:
task3_job_roles

  Employee_ID Job_сode
0        E001      J01
1        E001      J02
2        E002      J02
3        E002      J03
4        E003      J01

In [19]:
task3_employees_3nf = task3_employees[['Employee_ID', 'Name', 'Home_city']]
task3_employees_3nf

  Employee_ID   Name Home_city
0        E001  Alice    Moscow
1        E002    Bob      Perm
2        E003  Alice      Perm

In [20]:
task3_jobs

  Job_сode        Job
0      J01       Chef
1      J02     Waiter
2      J03  Bartender

In [21]:
task3_cities = task3_employees[['City_code', 'Home_city']].drop_duplicates().reset_index(drop=True)
task3_cities
#3NF

   City_code Home_city
0         26    Moscow
1         56      Perm